# CLI tools
## modern cli tools (things to alias)
brew "eza"           # Modern ls replacement
brew "zoxide"        # Smarter cd command
brew "duf"           # Modern df replacement

## cli apps
brew "lazygit"       # Terminal UI for git
brew "nushell"       # Modern structured shell
brew "tldr"          # Simplified man pages

## tools
brew "bitwarden-cli" # Password manager CLI
brew "fzf"           # Fuzzy finder
brew "gh"            # GitHub CLI
brew "pwgen"         # Password generator
brew "xh"            # Modern curl replacement
brew "direnv"        # Directory-based env vars
brew "tmux"          # Terminal multiplexer

# macOS apps
if OS.mac?
  # essential
  cask "mouseless"

  # fonts
  cask "font-m-plus-code-latin"

  # rogue amoeba
  cask "audio-hijack"
  cask "farrago"
  cask "fission"
  cask "loopback"
  cask "piezo"
  cask "soundsource"

  # chat clients
  cask "discord"
  cask "telegram"

  cask "plex"
  cask "iterm2"             # Terminal emulator
  cask "arc"                # Browser
  cask "raycast"            # Launcher
  cask "orbstack"           # Docker
  cask "jetbrains-toolbox"  # IDE manager
  cask "obsidian"           # Notes
  cask "claude"             # AI assistant
  cask "betterdisplay"      # Display management
end
