# taps
tap "oven-sh/bun"

## tap brews
brew "bun"

# cli tools
## modern cli tools (things to alias)
brew "eza"           # Modern ls replacement
brew "zoxide"        # Smarter cd command
brew "duf"           # Modern df replacement

## cli apps
brew "lazygit"       # Terminal UI for git
brew "nushell"       # Modern structured shell
brew "tldr"          # Simplified man pages

## tools
brew "bitwarden-cli" # Password manager CLI
brew "fzf"           # Fuzzy finder
brew "gh"            # GitHub CLI
brew "pwgen"         # Password generator
brew "xh"            # Modern curl replacement
brew "direnv"        # Directory-based env vars
brew "tmux"          # Terminal multiplexer
brew "lazydocker"    # docker tui
brew "lnav"          # logfile navigator
brew "asciinema"     # cli recorder

# macOS apps
if OS.mac?
  # essential
  cask "iterm2"             # Terminal emulator
  cask "arc"                # Browser
  cask "orbstack"           # Docker
  cask "jetbrains-toolbox"  # IDE manager
  cask "betterdisplay"      # Display managemen
  cask "claude"             # AI Assistant
  cask "obsidian"

  # fonts
  cask "font-m-plus-code-latin"

  # rogue amoeba
  cask "audio-hijack"
  cask "farrago"
  cask "fission"
  cask "loopback"
  cask "piezo"
  cask "soundsource"

  # chat clients
  cask "discord"
  cask "telegram"

  # paid
  cask "imazing"
  cask "mouseless"

  # misc
  cask "raycast"
  cask "affinity"
  cask "raspberry-pi-imager"
  cask "angry-ip-scanner"
  cask "slack"
  cask "cyberduck"
  cask "balenaetcher"

  # media
  cask "plex"
  cask "mpv"
  cask "spotify"
end
