# taps
tap "oven-sh/bun"
tap "filosottile/musl-cross"
tap "nikitabobko/tap"

# brews from taps
brew "bun"
brew "musl-cross"
cask "aerospace"

# modern cli replacements
brew "eza"           # ls
brew "zoxide"        # cd
brew "duf"           # df
brew "xh"            # curl

# shell & terminal
brew "nushell"
brew "tmux"
brew "fzf"
brew "direnv"

# tui apps
brew "lazygit"
brew "lazydocker"
brew "lnav"

# dev tools
brew "git"
brew "git-lfs"
brew "gh"
brew "cmake"
brew "binaryen"      # rust wasm
brew "uv"
brew "pipx"
brew "typst"
brew "julia"
brew "postgresql@18"

# utilities
brew "chezmoi"
brew "bitwarden-cli"
brew "pwgen"
brew "tldr"
brew "asciinema"
brew "borgbackup"
brew "borgmatic"

# macOS apps
if OS.mac?
  # browsers
  cask "arc"
  cask "google-chrome"
  cask "firefox"

  # terminal & editors
  cask "iterm2"
  cask "visual-studio-code"
  cask "vscodium"

  # dev tools
  cask "orbstack"
  cask "jetbrains-toolbox"
  cask "polypane"

  # ai
  cask "claude"
  cask "claude-code"

  # communication
  cask "slack"
  cask "discord"
  cask "telegram"
  cask "whatsapp"
  cask "teamspeak-client@beta"

  # rogue amoeba
  cask "audio-hijack"
  cask "farrago"
  cask "fission"
  cask "loopback"
  cask "piezo"
  cask "soundsource"

  # media & games
  cask "plex"
  cask "stolendata-mpv"
  cask "spotify"
  cask "obs"
  cask "steam"
  cask "multimc"
  cask "temurin"       # java runtime for multimc

  # design & fabrication
  cask "affinity"
  cask "blender"
  cask "inkscape"
  cask "drawio"
  cask "rhino-app"
  cask "bambu-studio"
  cask "kicad"

  # productivity
  cask "libreoffice"

  # system utilities
  cask "raycast"
  cask "bitwarden"
  cask "betterdisplay"
  cask "obsidian"
  cask "tailscale-app"
  cask "utm"
  cask "imazing"
  cask "mouseless"
  cask "keyboardcleantool"
  cask "anydesk"
  cask "cyberduck"

  # imaging & networking
  cask "raspberry-pi-imager"
  cask "balenaetcher"
  cask "angry-ip-scanner"

  # fonts
  cask "font-m-plus-code-latin"
end
